{"id":"53e5df18-6d15-4272-b153-fcd3ca10c3ad","rule_id":"93724a43-c759-4aaa-8284-05c17ae5bdf3","name":"OT Brute Force with Successful Login","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":1,"updated_at":"2026-03-10T07:28:06.865Z","updated_by":"2894098180","created_at":"2026-03-09T07:45:43.724Z","created_by":"2894098180","enabled":true,"interval":"5m","from":"now-1445m","to":"now","description":"Flags alert when multiple login attempts fail (min3) and it is followed by a successful log in attempt within a short duration (10min).","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":90,"risk_score_mapping":[],"severity":"critical","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"https://mini-soc-project-d42e34.kb.asia-south1.gcp.elastic-cloud.com/app/security"},"type":"eql","language":"eql","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*",".ds-logs-filestream.generic-default-*"],"query":"sequence by source.ip with maxspan=10m\n  [any where event.action == \"LOGIN_FAILED\"] with runs=3\n  [any where event.action == \"LOGIN_SUCCESS\"]","filters":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
