{"id":"8209db1f-4893-47cf-95a8-eec0c311d8c5","rule_id":"5c50db12-27ad-45b8-a9ce-0f1180b7f7f9","name":"OT Brute Force","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":0,"updated_at":"2026-03-09T06:24:43.712Z","updated_by":"2894098180","created_at":"2026-03-09T06:24:43.712Z","created_by":"2894098180","enabled":true,"interval":"5m","from":"now-1445m","to":"now","description":"Detect multiple failed login attempts","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":47,"risk_score_mapping":[],"severity":"medium","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"https://mini-soc-project-d42e34.kb.asia-south1.gcp.elastic-cloud.com/app/security"},"type":"threshold","language":"kuery","index":[".ds-logs-filestream.generic-default-*"],"query":"event.action : \"LOGIN_FAILED\"","filters":[],"threshold":{"field":["source.ip"],"value":2,"cardinality":[]}}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
