{"id":"c052e9e2-17ca-4dd0-82de-5663dad6e24e","rule_id":"9efc17dd-7e2a-48ef-8024-baee2cf41873","name":"OT Privilage Escalation","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":0,"updated_at":"2026-03-09T07:50:22.471Z","updated_by":"2894098180","created_at":"2026-03-09T07:50:22.471Z","created_by":"2894098180","enabled":true,"interval":"5m","from":"now-1445m","to":"now","description":" Detects role changes or new user creation","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":70,"risk_score_mapping":[],"severity":"high","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"https://mini-soc-project-d42e34.kb.asia-south1.gcp.elastic-cloud.com/app/security"},"type":"query","language":"kuery","index":[".ds-logs-filestream.generic-default-*"],"query":"event.action : \"ROLE_CHANGE\" or event.action : \"USER_CREATED\"","filters":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
